'''
1. Создать список и заполнить его элементами различных типов данных.
Реализовать скрипт проверки типа данных каждого элемента. Использовать функцию type() для проверки типа.
Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.
'''
my_list = ['Кеша', 2, 15.05, 'Огурец', False, None ]
for el in my_list:
    print(el, type(el))
    

